app/AttributeType.php

    public function get_all(){
        return AttributeType::all();
---
select * from `attribute_types`