app/Category.php

    public function add($fields) {
        $Category = new Category();
        $Category->fill($fields);
        $Category->save();
---
insert into `categories` (`title`, `descr`, `parent_category`, `meta_title`, `meta_description`, `slug`, `updated_at`, `created_at`) values ('Новости', '<p><strong>Еуые</strong></p>', '0', 'Новости аукциона title', 'Новости аукциона descr', 'novosti', '2019-06-10 08:17:59', '2019-06-10 08:17:59')

    public function edit($fields){
        $Category = Category::find($fields['id']);
        $Category->fill($fields);
        $Category->save();
---
update `categories` set `title` = 'Новости 1', `categories`.`updated_at` = '2019-06-10 12:15:53' where `id` = 2