app/Pages.php

insert into `pages` (`title`, `meta_title`, `meta_description`, `short_descr`, `descr`, `slug`, `updated_at`, `created_at`) values ('Просто страница', 'dfdfdf', 'sdsdsdsdsffgfg', '<p>Краткое описание</p>', '<p>Полное описание</p>', 'prosto-stranica', '2019-06-10 14:17:32', '2019-06-10 14:17:32')
---
    public static function add($fields)
    {
        $page = new static;
        $page->fill($fields);

        $page->save();

update `pages` set `image` = 'J2cNIaZPk0.jpeg', `pages`.`updated_at` = '2019-06-10 14:17:33' where `id` = 15
---
    public function uploadImage($image)
    {
        if ( $image == null ) return;

        $this->removeImage();

        $filename = Str::random(10) . '.' . $image->extension();
        $image->storeAs('uploads', $filename);
        $this->image = $filename;
        $this->save();

update `pages` set `category_id` = '2', `pages`.`updated_at` = '2019-06-10 14:17:33' where `id` = 15
---
    public function setCategory($id)
    {
        if ( $id == null )
            return;

        $this->category_id = $id;
        $this->save();

update `pages` set `title` = 'Страница', `meta_title` = 'Page', `meta_description` = 'page-description', `pages`.`updated_at` = '2019-06-10 14:18:13' where `id` = 15
---
    public function edit($fields)
    {
        $this->fill($fields);
        $this->save();

delete from `pages` where `id` = 8
---
    public function remove()
    {
        $this->removeImage();
        $this->delete();