app/User.php

    public static function add($fields)
    {
        $user = new static;
        $user->fill($fields);
        $user->save();
---
insert into `users` (`name`, `email`, `town`, `updated_at`, `created_at`) values ('Денис', 'kdo@webernetic.by', 'Минск', '2019-06-10 09:22:01', '2019-06-10 09:22:01')

    public function generatePassword($password)
    {
        if ( $password != null ) {
            $this->password = bcrypt($password);
            $this->save();
---
update `users` set `password` = 'y$KNTT/WHKUiSpWWqOG9.waOqE80NblOsB7.Abz4C6s34KL4tiQITqi', `users`.`updated_at` = '2019-06-10 09:22:01' where `id` = 1