app/Providers/AppServiceProvider.php

select * from `attribute_types`
---
    public function boot()
    {
        view()->composer('admin.layout', function ($view) {

            $data = [];

            $user_model = new User();
            $data['adminImage'] =  $user_model->get_avatar(Auth::user()->avatar);
            $data['adminName'] = Auth::user()->name;
            $data['attribyt_type'] = AttributeType::all();