app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $data = array();
        $data['breadcrumb_header'] = AppServiceProvider::get_breadcrumb_header();

        $data['categories'] = Category::all();
---
select * from `categories`

    public function edit($id)
    {
        $data = array();
        $data['breadcrumb_header'] = AppServiceProvider::get_breadcrumb_header();;

        $data['categories'] = Category::all();
---
select * from `categories`