app/Http/Controllers/Admin/PagesController.php

select * from `pages`
---
    public function index()
    {
<<<<<<< HEAD:app/Http/Controllers/Admin/PagesController.php
        $posts = Pages::all();