app/Http/Controllers/Admin/TagsController.php

    public function index()
    {
        $tags = Tag::all();
---
select * from `tags`