app/Http/Controllers/Admin/UsersController.php

    public function index()
    {
        $data = [];
        $data['breadcrumb_header'] = AppServiceProvider::get_breadcrumb_header();;

        $data['users'] = User::all();
---
select * from `users`